In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
data = 'https://raw.githubusercontent.com/alexeygrigorev/datasets/master/course_lead_scoring.csv'

In [4]:
!wget $data

--2025-10-29 08:53:24--  https://raw.githubusercontent.com/alexeygrigorev/datasets/master/course_lead_scoring.csv
Resolving raw.githubusercontent.com (raw.githubusercontent.com)... 185.199.110.133, 185.199.108.133, 185.199.111.133, ...
Connecting to raw.githubusercontent.com (raw.githubusercontent.com)|185.199.110.133|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 80876 (79K) [text/plain]
Saving to: ‘course_lead_scoring.csv.1’

course_lead_scoring 100%[===================>]  78.98K  --.-KB/s    in 0.002s

2025-10-29 08:53:25 (43.3 MB/s) - ‘course_lead_scoring.csv.1’ saved [80876/80876]

In [5]:
df = pd.read_csv(data)
df.head()

,lead_source,industry,number_of_courses_viewed,annual_income,employment_status,location,interaction_count,lead_score,converted
0,paid_ads,NaN,1,79450.0,unemployed,south_america,4,0.94,1
1,social_media,retail,1,46992.0,employed,south_america,1,0.80,0
2,events,healthcare,5,78796.0,unemployed,australia,3,0.69,1
3,paid_ads,retail,2,83843.0,NaN,australia,1,0.87,0
4,referral,education,3,85012.0,self_employed,europe,3,0.62,1

In [6]:
df.isnull().sum()

lead_source                 128
industry                    134
number_of_courses_viewed      0
annual_income               181
employment_status           100
location                     63
interaction_count             0
lead_score                    0
converted                     0
dtype: int64

In [36]:
string_columns = list(df.dtypes[df.dtypes == 'object'].index)
string_columns

['lead_source', 'industry', 'employment_status', 'location']

In [37]:
for col in string_columns:
    df[col] = df[col].str.lower().str.replace(' ', '_')
    df[col] = df[col].str.replace('-','_')

In [43]:
df.columns

Index(['lead_source', 'industry', 'number_of_courses_viewed', 'annual_income',
       'employment_status', 'location', 'interaction_count', 'lead_score',
       'converted'],
      dtype='object')

In [42]:
df[string_columns] = df[string_columns].fillna('NA')
df[string_columns]

         lead_source       industry employment_status       location
0           paid_ads             NA        unemployed  south_america
1       social_media         retail          employed  south_america
2             events     healthcare        unemployed      australia
3           paid_ads         retail                NA      australia
4           referral      education     self_employed         europe
...              ...            ...               ...            ...
1457        referral  manufacturing     self_employed  north_america
1458        referral     technology           student         europe
1459        paid_ads     technology           student  north_america
1460        referral             NA     self_employed  north_america
1461  organic_search        finance           student  north_america

[1462 rows x 4 columns]

In [17]:
df.dtypes

lead_source                  object
industry                     object
number_of_courses_viewed      int64
annual_income               float64
employment_status            object
location                     object
interaction_count             int64
lead_score                  float64
converted                     int64
dtype: object

In [21]:
df['annual_income'] = df['annual_income'].fillna(0.0)
df['annual_income']

0       79450.0
1       46992.0
2       78796.0
3       83843.0
4       85012.0
         ...
1457        0.0
1458    65259.0
1459    45688.0
1460    71016.0
1461    92855.0
Name: annual_income, Length: 1462, dtype: float64

In [24]:
df.head()

,lead_source,industry,number_of_courses_viewed,annual_income,employment_status,location,interaction_count,lead_score,converted
0,paid_ads,NA,1,79450.0,unemployed,south_america,4,0.94,1
1,social_media,retail,1,46992.0,employed,south_america,1,0.80,0
2,events,healthcare,5,78796.0,unemployed,australia,3,0.69,1
3,paid_ads,retail,2,83843.0,NA,australia,1,0.87,0
4,referral,education,3,85012.0,self_employed,europe,3,0.62,1

In [25]:
df['industry'].value_counts()

industry
retail           203
finance          200
other            198
healthcare       187
education        187
technology       179
manufacturing    174
NA               134
Name: count, dtype: int64

In [57]:
num_columns = df[['number_of_courses_viewed', 'annual_income', 'interaction_count', 'lead_score']]
num_columns

      number_of_courses_viewed  annual_income  interaction_count  lead_score
0                            1        79450.0                  4        0.94
1                            1        46992.0                  1        0.80
2                            5        78796.0                  3        0.69
3                            2        83843.0                  1        0.87
4                            3        85012.0                  3        0.62
...                        ...            ...                ...         ...
1457                         1            0.0                  4        0.53
1458                         3        65259.0                  2        0.24
1459                         1        45688.0                  3        0.02
1460                         5        71016.0                  0        0.25
1461                         3        92855.0                  3        0.41

[1462 rows x 4 columns]

In [72]:
cre = df[['interaction_count', 'lead_score']].corr()
cre

                   interaction_count  lead_score
interaction_count           1.000000    0.009888
lead_score                  0.009888    1.000000

In [73]:
cro = df[['number_of_courses_viewed', 'lead_score']].corr()
cro

                          number_of_courses_viewed  lead_score
number_of_courses_viewed                  1.000000   -0.004879
lead_score                               -0.004879    1.000000

In [74]:
cri = df[['number_of_courses_viewed', 'interaction_count']].corr()
cri

                          number_of_courses_viewed  interaction_count
number_of_courses_viewed                  1.000000          -0.023565
interaction_count                        -0.023565           1.000000

In [75]:
cru = df[['annual_income', 'interaction_count']].corr()
cru

                   annual_income  interaction_count
annual_income           1.000000           0.027036
interaction_count       0.027036           1.000000